# YOLOv8x-seg + SACR-fenlei2-MSMLP
# Main YOLO segmentation is tree-only in loss; final species logits come from detached multi-scale MLP.
# SACR refine_alpha schedule is set in train.py/head.py: epoch<20=0, epoch20-40 linear 0->0.03, epoch>=40=0.03.
# Last layer args: [tree_nc, species_nc, nm, npr]

nc: 2  # tp1, tp2; main YOLO loss folds all GT cls to tree=0
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]  # 15 = P3
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]  # 18 = P4
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]] # 21 = P5

  # SACR-fenlei2-MSMLP head: [tree_nc, species_nc, nm, npr]
  - [[15, 18, 21], 1, SACRSpeciesSegment, [1, 2, 32, 256]]
